TOPICS = {
    "business_ec": "Бизнес и экономика",
    "entertainment": "Культура и развлечения",
    "politics": "Политика",
    "science_tech": "Наука и технологии",
    "social": "Люди и общество",
    "sport": "Спорт",
    "travel": "Путешествия"
}

MINCONN = 1
MAXCONN = 10

ADDITIONAL_STOP_WORDS_RU = [
    "в", "который", "под", "по", "на", "при", "о", "к", "также", "это",
    "такой", "кроме", "ру", "свой", "лента", "каждый", "другой", "свой",
    "быть", "являться", "во", "над", "изза", "их", "но", "из", "со",
    "около", "кто-то", "очень", "видимо", "ко", "лентару", "риа", "новости",
    "другой", "такой", "свои", "сам", "тот",  "этот", "однако",
    "например", "это", "один", "являться"
]

ADDITIONAL_PUNCT_VALUES = [
    "`", "``", "''", "'", "»", "«", "\\", "-", "–", "+", "=", "*", "&", "%",
    "в", "который", "под", "по", "на", "при", "о", "к", "который", "также", "это",
     "такой", "кроме", "ру", "свой", "лента", "каждый", "—", "который"
]

EMOJI_TOPICS = {
    "Бизнес и экономика": "💼",
    "Культура и развлечения": "🏛",
    "Политика": "🌍",
    "Наука и технологии": "🔭",
    "Люди и общество": "✍🏻",
    "Спорт": "⚽️",
    "Путешествия": "✈️",
}
